In [1]:
import pandas as pd

In [2]:
pd.__version__

'2.2.3'

In [4]:
data= pd.read_csv("cinema_hall_ticket_sales.csv")

In [5]:
data

,Ticket_ID,Age,Ticket_Price,Movie_Genre,Seat_Type,Number_of_Person,Purchase_Again
0,N4369,55,12.27,Comedy,Standard,7,No
1,B8091,35,19.02,Drama,Standard,Alone,Yes
2,V6341,55,22.52,Horror,VIP,3,No
3,B3243,53,23.01,Drama,Standard,6,Yes
4,I3814,30,21.81,Comedy,VIP,4,Yes
...,...,...,...,...,...,...,...
1435,E5406,41,17.09,Sci-Fi,Standard,2,Yes
1436,C4357,19,11.45,Action,Standard,Alone,No
1437,R7285,53,17.13,Comedy,Premium,Alone,Yes
1438,W6360,34,20.25,Comedy,Premium,2,Yes
1439,Z8034,60,21.90,Action,VIP,Alone,No

In [6]:
data.head(1)

,Ticket_ID,Age,Ticket_Price,Movie_Genre,Seat_Type,Number_of_Person,Purchase_Again
0,N4369,55,12.27,Comedy,Standard,7,No

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1440 entries, 0 to 1439
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Ticket_ID         1440 non-null   object
 1   Age               1440 non-null   int64
 2   Ticket_Price      1440 non-null   float64
 3   Movie_Genre       1440 non-null   object
 4   Seat_Type         1440 non-null   object
 5   Number_of_Person  1440 non-null   object
 6   Purchase_Again    1440 non-null   object
dtypes: float64(1), int64(1), object(5)
memory usage: 78.9+ KB

In [8]:
#we have a correct data types so now we check for null and NaN values
data.isna().sum()

Ticket_ID           0
Age                 0
Ticket_Price        0
Movie_Genre         0
Seat_Type           0
Number_of_Person    0
Purchase_Again      0
dtype: int64

In [9]:
data.isnull().sum()

Ticket_ID           0
Age                 0
Ticket_Price        0
Movie_Genre         0
Seat_Type           0
Number_of_Person    0
Purchase_Again      0
dtype: int64

In [10]:
#so we have everything okay

In [11]:
#now i want to rename the column names
data.columns

Index(['Ticket_ID', 'Age', 'Ticket_Price', 'Movie_Genre', 'Seat_Type',
       'Number_of_Person', 'Purchase_Again'],
      dtype='object')

In [12]:
data=data.rename(columns={
    'Ticket_ID': 'Ticket ID',
    'Ticket_Price': 'Ticket Price', 
    'Movie_Genre': 'Movie Genre', 
    'Seat_Type': 'Seat Type',
    'Number_of_Person': 'Number of persons', 
    'Purchase_Again': 'Purchase Again'
})

In [13]:
data.columns

Index(['Ticket ID', 'Age', 'Ticket Price', 'Movie Genre', 'Seat Type',
       'Number of persons', 'Purchase Again'],
      dtype='object')

In [14]:
data.head(1)

,Ticket ID,Age,Ticket Price,Movie Genre,Seat Type,Number of persons,Purchase Again
0,N4369,55,12.27,Comedy,Standard,7,No

In [16]:
data.to_csv("cleaned_cinema_data.csv", index=False)